In [1]:
import pandas as pd

In [2]:
# read the titanic data set
df = pd.read_csv('titanic.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
# find null values in each column
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
# get rid of column with large null values
df.drop(['Cabin'], axis=1, inplace=True)

In [6]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [7]:
# fill null values in age column
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [8]:
df['Age'].isnull().sum()

0

In [9]:
df['Embarked'].fillna(df['Embarked'].mode().iloc[0], inplace=True)

In [10]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [11]:
# check the number of male population and female population
df['Sex'].value_counts().loc['male']

577

In [12]:
# check nuber of survived and dead people
df['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [27]:
# check number of dead male
((df['Survived'] == 0) & (df['Sex'] == 'male')).sum()

468

In [26]:
# check number of survived male
((df['Survived'] == 1) & (df['Sex'] == 'male')).sum()

109

In [15]:
# check number of dead female
(df['Survived'].value_counts()[0]) & (df['Sex'].value_counts()['female'])

32

In [16]:
# check number of survived female
(df['Survived'].value_counts()[1]) & (df['Sex'].value_counts()['female'])

274

In [17]:
# check number of male whose age is greater than 80
((df['Age'].astype('int') >= 80) & (df['Sex'] == 'male')).sum()

1

In [29]:
# check number of female who age is in between 30 and 50
(((df['Age'].astype('int') >= 30) & (df['Age'].astype('int') >= 50)) & (df['Sex'] == 'male')).sum()

52

In [19]:
df.iloc[[(df['Age'] == 80).idxmax()]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,S

In [20]:
# check the number of embarked places
df['Embarked'].value_counts()

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [33]:
# check how many people departed from S, C and Q port
df['Embarked'].value_counts()['S']
df['Embarked'].value_counts()['C']
df['Embarked'].value_counts()['Q']

77

In [22]:
# change fare and age column to int 
df['Age'] = df['Age'].astype('int')
df['Fare'] = df['Fare'].astype('int')

In [23]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29,1,2,W./C. 6607,23,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7,Q

In [24]:
# check number of people whose sibsp count was 1
(df['SibSp'] == 1).sum()

209

In [25]:
df['SibSp'].value_counts()[1]

209